to_be_refactored/logs/log4

POST /Server0/CDS_control HTTP/1.1
Host: 192.168.54.1:60606
User-Agent: Panasonic Android/1 DM-CP
Content-Type: text/xml; charset="utf-8"
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"
Content-Length: 582

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
 <s:Body>
  <u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1" xmlns:pana="urn:schemas-panasonic-com:pana">
   <ObjectID>0</ObjectID>
   <BrowseFlag>BrowseDirectChildren</BrowseFlag>
   <Filter>*</Filter>
   <StartingIndex>135</StartingIndex>
   <RequestedCount>15</RequestedCount>
   <SortCriteria></SortCriteria>
   <pana:X_FromCP>LumixLink2.0</pana:X_FromCP>
  </u:Browse>
 </s:Body>
</s:Envelope>
HTTP/1.1 200 OK
CONTENT-LENGTH: 13991
CONTENT-TYPE: text/xml;charset="utf-8"
DATE: Mon, 13 Feb 2012 14:26:50 GMT
EXT:
SERVER: Linux/4.0 UPnP/1.0 Panasonic-UPnP-MW/1.0
CONNECTION: close

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:BrowseResponse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1">
      <Result>&lt;DIDL-Lite xmlns=&quot;urn:schemas-upnp-org:metadata-1-0/DIDL-Lite/&quot; xmlns:dc=&quot;http://purl.org/dc/elements/1.1/&quot; xmlns:upnp=&quot;urn:schemas-upnp-org:metadata-1-0/upnp/&quot;&gt;&lt;item id=&quot;1020376&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0376&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020376.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020376.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020376.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020377&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0377&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020377.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020377.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020377.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020378&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0378&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020378.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020378.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020378.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020379&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0379&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020379.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020379.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020379.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020380&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0380&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020380.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020380.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020380.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020381&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0381&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020381.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020381.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020381.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020382&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0382&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020382.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020382.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020382.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020383&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0383&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020383.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020383.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020383.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020384&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0384&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020384.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020384.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020384.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020385&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0385&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020385.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020385.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020385.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020386&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0386&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020386.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020386.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020386.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020387&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0387&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020387.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020387.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020387.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020388&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0388&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020388.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020388.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020388.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020389&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0389&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020389.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020389.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020389.JPG&lt;/res&gt;&lt;/item&gt;&lt;item id=&quot;1020390&quot; parentID=&quot;0&quot; restricted=&quot;0&quot;&gt;&lt;dc:title&gt;102-0390&lt;/dc:title&gt;&lt;upnp:writeStatus&gt;WRITABLE&lt;/upnp:writeStatus&gt;&lt;upnp:class name=&quot;imageItem&quot;&gt;object.item.imageItem&lt;/upnp:class&gt;&lt;res protocolInfo=&quot;http-get:*:application/octet-stream;PANASONIC.COM_PN=CAM_RAW&quot;&gt;http://192.168.54.1:50001/DO1020390.RAW&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_TN;DLNA.ORG_OP=01;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_TN&quot;&gt;http://192.168.54.1:50001/DT1020390.JPG&lt;/res&gt;&lt;res protocolInfo=&quot;http-get:*:image/jpeg:DLNA.ORG_PN=JPEG_MED;DLNA.ORG_OP=01;DLNA.ORG_CI=0;DLNA.ORG_FLAGS=00900000000000000000000000000000;PANASONIC.COM_PN=CAM_LRGTN&quot;&gt;http://192.168.54.1:50001/DL1020390.JPG&lt;/res&gt;&lt;/item&gt;&lt;/DIDL-Lite&gt;</Result>
      <NumberReturned>15</NumberReturned>
      <TotalMatches>161</TotalMatches>
      <UpdateID>1</UpdateID>
    </u:BrowseResponse>
  </s:Body>
</s:Envelope>
